site.org
#
# The gh-pages site at 'https://j-keck.github.io/reno
# are generated from this file

#
#+title: reno - reading notes extractor
#+hugo_base_dir: ./doc/site
#+options: creator:t author:nil

* Usage
  :PROPERTIES:
  :export_file_name: usage
  :export_hugo_weight: 30
  :export_hugo_section: docs
  :END:

** Usage

 #+BEGIN_EXAMPLE
main⟩ reno --help
Usage:
    reno export
    reno update
    reno dump

reading notes extractor

Options and flags:
    --help
        Display this help text.
    --version, -v
        Print the version number and exit.

Subcommands:
    export
        Export the annotations from the given Pdf
    update
        update the notes in the Org-file with new annotations from the Pdf
    dump
        for debugging / inspection (run without arguments for the usage)
 #+END_EXAMPLE

** Export annotations to an org-file

Use the ~export~ subcommand to export your annotations.

#+BEGIN_EXAMPLE
main⟩ reno export
Usage: reno export [--overwrite] [--pdf-engine <value>] [--mark-from <value>] <pdf> [<org>]

Export the annotations from the given Pdf

Options and flags:
    --help
        Display this help text.
    --overwrite, -f
        Overwrite existing file
    --pdf-engine <value>
        Used pdf engine (itext / pdfbox)
    --mark-from <value>
        Extract mark from (boundingrect / quads)

#+END_EXAMPLE


** Update new annotations

To update your org-file and include new annotations from your pdf, use the ~update~ subcommand.

#+BEGIN_EXAMPLE
main⟩ reno update
Usage: reno update [--pdf-engine <value>] [--mark-from <value>] <pdf> [<src-org>] [<dst-org>]

update the notes in the Org-file with new annotations from the Pdf

Options and flags:
    --help
        Display this help text.
    --pdf-engine <value>
        Used pdf engine (itext / pdfbox)
    --mark-from <value>
        Extract mark from (boundingrect / quads)
#+END_EXAMPLE

